{"author":{"id":"MDQ6VXNlcjE0MzE5MDQ=","is_bot":false,"login":"konard","name":"Konstantin Diachenko"},"body":"## Summary\nThis PR fixes THREE related bugs with enemy shooting and facing direction:\n\n### Bug #1: Muzzle Position\nBullets were spawning from inconsistent positions (back, side, or weapon) instead of always from the weapon muzzle.\n\n**Root Cause**: The code used `Vector2.from_angle(rotation)` which doesn't account for the vertical scale flip.\n\n**Fix**: Changed to use `_weapon_sprite.global_transform.x.normalized()` which gives the actual visual forward direction.\n\n### Bug #2: Model Facing Direction (Flip Compensation)\nAfter the muzzle fix, bullets spawned correctly but enemies visually turned their backs to the player.\n\n**Root Cause**: When the model is flipped vertically (scale.y negative) to avoid upside-down appearance, the rotation angle's visual effect is inverted.\n\n**Fix**: Negate the rotation angle when applying the vertical flip.\n\n### Bug #3: Model Facing Direction (Dual Rotation Conflict) - LATEST FIX\nAfter the flip compensation fix, enemies still faced backwards.\n\n**Root Cause**: The EnemyModel (child node) used local `rotation`, but the Enemy CharacterBody2D (parent) also had its own rotation set in various places (aiming, patrol, etc.). Since visual rotation = parent + child rotation, the model faced incorrectly.\n\n**Fix**: Use `global_rotation` instead of local `rotation` for EnemyModel. This sets the visual direction in world coordinates, independent of parent rotation.\n\n```gdscript\n# Before (buggy):\n_enemy_model.rotation = -target_angle  # Affected by parent's rotation\n\n# After (fixed):\n_enemy_model.global_rotation = -target_angle  # World coordinates, unaffected by parent\n```\n\n## Changes\n- **enemy.gd**: Use `global_rotation` for `_enemy_model` facing direction\n- **player.gd**: Same fix applied for consistency (player also has rotation during grenade throws)\n- **docs/case-studies/issue-245/**: Updated analysis with full root cause investigation\n\n## Test plan\n- [ ] Verify enemies face the player when shooting (not their backs)\n- [ ] Verify bullets spawn from weapon muzzle when enemy faces RIGHT\n- [ ] Verify bullets spawn from weapon muzzle when enemy faces LEFT (flipped model)\n- [ ] Verify bullets fly toward the player from the muzzle\n- [ ] Verify player character also faces correctly when aiming left\n\n## Technical Details\nThis fix addresses a parent-child transform composition issue in Godot. When a child node's local rotation is combined with the parent's rotation, the visual result can be unexpected. Using `global_rotation` directly sets the world-space rotation, bypassing this composition.\n\nFixes #245\n\n🤖 Generated with [Claude Code](https://claude.com/claude-code)","closedAt":"2026-01-22T15:24:46Z","createdAt":"2026-01-22T11:21:01Z","mergedAt":"2026-01-22T15:24:46Z","mergedBy":{"id":"U_kgDOB_qn0g","is_bot":false,"login":"Jhon-Crow","name":"Jhon-Crow"},"title":"Fix enemy shooting: bullets spawn from weapon muzzle, model faces player correctly"}
