{
  "title": "добавь врагам возможность тактически кидать гранаты",
  "title_en": "Add tactical grenade throwing ability to enemies",
  "author": "Jhon-Crow",
  "createdAt": "2026-01-22T21:30:16Z",
  "updatedAt": "2026-01-23T16:22:04Z",
  "labels": [],
  "state": "OPEN",
  "body_original": "внимание - по дефолту у врагов нет гранат, для каждой карты я сам скажу, у кого и какие гранаты.\nвраг с гранатой может перейти в режим \"готов кинуть гранату\":\n1. метатель \"сообщает\" врагам, находящимся на линии броска или в предполагаемой зоне поражения о предстоящем броске - оповещённые враги с максимальным приоритетом в разные стороны (куда ближе) освобождают зону поражения/ линию броска.\n2. подходит на расстояние для броска либо в укрытие, которое укрывает от лучей, выпущенных из игрока во все стороны и игнорирующих одно укрытие. бросок случайным образом отклоняется в рамках сектора 10 градусов, то есть максимум на 5 градусов в одну или другую сторону.\n3. все разбежавшиеся враги ждут, чтобы после взрыва организованно начать зачистку, зачистка начинается сразу после взрыва.\n4. метатель выходит из-за укрытия если это нужно чтоб закинуть гранату игроку и кидает гранату\n5. кинув гранату враг должен прицелиться в то место, куда кидал гранату и приблизиться до безопасного расстояния. если граната не наступательная или не летальная прячется за то укрытие, за которым в него не попадут выпущенные во все стороны из места падения гранаты лучи и до которого успеет добраться до взрыва.\n6. сразу после взрыва - идёт штурмовать через тот проход, через который кидал гранату.\n\nрежим метания включается:\n1. когда игрок подавил врагов в поле зрения метателя или самого метателя, а затем скрылся из виду и не показывается 6 секунд.\n2. когда игрок преследует подавленного метателя\n3. когда игрок на глазах метателя убивает 2 и более врагов.\n4. когда метатель слышит пустой магазин или начало перезарядки, но не видит игрока (будет кидать туда, от куда был звук).\n5. если услышит не прекращающуюся стрельбу в течении 10 секунд (в смысле в течении 10 секунд будет звучать выстрел) в зоне размером одну шестую вьюпорта.\n6. когда у метателя осталось 1 hp и меньше.\n\nдай 2 наступательные гранаты врагу находящемуся на карте здание в помещении main hall.",
  "body_translated": {
    "note": "Translated from Russian to English for analysis",
    "content": "Note: By default enemies have no grenades - for each map I will specify which enemies have which grenades.\n\nAn enemy with a grenade can enter 'ready to throw grenade' mode:\n\n1. The thrower 'notifies' enemies in the line of throw or expected impact zone about the upcoming throw - notified enemies immediately clear the impact zone/line of throw in different directions (whichever is closest) with maximum priority.\n\n2. Approaches throwing distance OR moves to cover that protects from rays cast from the player in all directions ignoring one cover. The throw randomly deviates within a 10-degree sector, meaning maximum 5 degrees in either direction.\n\n3. All dispersed enemies wait, to begin organized cleanup after the explosion - cleanup starts immediately after the explosion.\n\n4. The thrower exits cover if needed to throw the grenade at the player and throws the grenade.\n\n5. After throwing, the enemy must aim at the landing spot and move to safe distance. If the grenade is not offensive/lethal, they hide behind cover that protects from rays cast in all directions from the grenade landing spot and that they can reach before explosion.\n\n6. Immediately after explosion - they assault through the passage where they threw the grenade.\n\nThrowing mode activates when:\n1. Player suppressed enemies in thrower's field of view or the thrower themselves, then hid and hasn't shown for 6 seconds.\n2. Player is chasing a suppressed thrower.\n3. Player kills 2+ enemies in thrower's sight.\n4. Thrower hears empty magazine or reload start but doesn't see player (will throw toward sound source).\n5. Hears continuous fire for 10 seconds (gunfire sound for 10 seconds) in an area 1/6 of viewport size.\n6. Thrower has 1 HP or less remaining.\n\nGive 2 offensive grenades to the enemy in the building map in the main hall room."
  }
}
